var w = {
	c: ['您好', '欢迎', '心情不错', 'Hi～', 'Hello!', '记得给她打个电话', '好天气', '^o^', ':D', '多喝水身体好', '欢迎到搜狐博客', '相逢的人会再相逢', '嘿咻嘿咻～', '多运动少生病', '-_-!', '欢迎来地球~', '股票又涨了~', 'hoho', '我赚钱了赚钱了～', '嘛钱不钱的，乐呵乐呵得了', '老婆，出来看上帝！～', '你太有才了！', '我看好你哦！', '不蒸馒头争口气', '美丽不打折', '饿滴神啊', '低调！低调！！', '素质，注意素质！', '你的春天来了吗？', '雪停了，花开了～', '人在江湖身不由己', '出来混迟早是要还的', '以德服人', '想唱就唱', '股票又涨了喔', '别理我烦着呢', 'ONLY YOU~~', '哇哈哈哈~~~', '天上掉馅饼啦', '人在呢~人在呢', '中国印·舞动的北京', '新北京，新奥运', '一起努力构建和谐社会', '迎接奥运我们一起努力', '您辛苦了～～', '出门在外不易啊～', '房子怎么那么贵？', '换个模板，换个心情', '来杯热咖啡吗？', '今天有好运～', '你又得意了？^_^', '不夸你我不痛快', 'Live or Die?', '人就是江湖！', 'I\'ll be back!', 'I\'m back!', 'to be or not to be!', '人在江湖飘，谁能不挨刀', '人活着，就得找乐子', '写自己的博，让别人去看吧！', '子曾经曰过：写博客吧~', 'Ni Hao', 'G’day', 'Olá', 'Bonjour', 'Ahoy', 'Kia ora', 'Salut', '‘Allo', 'Yo', 'Guten Tag', 'Oi', 'Kumusta', 'Hola', 'Shalom', 'Giorno', 'Namaste', 'Aloha'],
	m: ['早上好', '天亮了', '新的一天', '小鸟在歌唱~', '记得吃早点', '又堵车了:(', '!o!要打起精神', '一起去晨练', '*_*天气凉了', '注意增减衣服', 'Morning~', '不想上班@@', '早饭要吃好', '开开心心上班来', '走自己的路，让他们打的去吧...'],
	a: ['上午好', '好忙', '忙么？', '喝杯咖啡', '休息一下', '抓紧时间', '提高工作效率', '伸伸胳膊扭扭腰', '眼睛累了，眺望远方'],
	n: ['中午好', '午饭时间', '×_×小睡一会', '∮听会儿音乐吧', '多吃青菜', '饭要七成饱', '午饭要吃饱', '还不去吃饭？', '休息，休息一会儿', '鱼香肉丝里面是没有鱼的'],
	p: ['下午好', '屋里好热～', '工作完成了？', '提高工作效率', '#_#有些困', '打起精神来', '多喝水', '洗把脸', '忙啊忙啊~', '还不发工资'],
	d: ['傍晚好', '又堵车了:(', '还不下班？', '吃些什么？', '一会儿去买菜', '^O^今天我来做饭', '抓紧时间啦～', '晚饭要吃少', '没堵车:)', '不吃了，减肥~', '高高兴兴回家去', '走自己的路，让他们打的去吧...', '回家家找妈妈'],
	e: ['晚上好', '吃些什么？', ')o(要控制饮食', '饭后吃个水果', '去散散步', '有人请客么？', '还在加班？', '陪她去看场电影哦～', '晚上去跑步', '鱼香肉丝里面是没有鱼的', '各回各家，各找各妈'],
	l: ['夜里好', '还没睡？', '今夜星光灿烂～', '还在工作么？', '早点睡，明天精力充沛', '今天有何收获？', '给她发个晚安短信吧～', 'Tomorrow is another day!', '洗洗睡吧~'],
	w: ['凌晨好', '+_+好困啊', '通宵么？', '...zzZZ~~', '嘘～小声点', '不要睡太晚', '你在他乡还好吗', '几点了—_—', '睡吧，明天还上班~', '你不是一个人在战斗！', '长夜漫漫无心睡眠', '夜漫漫其修远兮~~', '醒醒～～醒醒～'],
	k: ['周末好', '好好休息一下', '去郊游吧～', '周末^o^睡个懒觉', '给家里打个电话吧', '该出去晒太阳了', '约朋友去打球', '一起去健身吧', '伸个懒腰~', '好兴奋！', '没有人在线:(', '是放风筝呢还是去踏青？', '出去玩儿了？写博客记录一下。', '你知道我们的相册可以记录你的生活吧？']
};
function gw() {
	var t = new Date()
	var h = t.getHours();
	var d = t.getDay();
	var l = w.c;
	if ( h>=6 && h<9 ) {l = l.concat(w.m);}
	if ( h>=9 && h<12 ) {l = l.concat(w.a);}
	if ( h>=12 && h<14 ) {l = l.concat(w.n);}
	if ( h>=14 && h<17 ) {l = l.concat(w.p);}
	if ( h>=17 && h<19 ) {l = l.concat(w.d);}
	if ( h>=19 && h<21 ) {l = l.concat(w.e);}
	if ( h>=21 && h<24 ) {l = l.concat(w.l);}
	if ( h>=0 && h<6 ) {l = l.concat(w.w);}
	if (d == 0 || d == 6) {	l = l.concat(w.k);}
	var n = Math.round(Math.random()*l.length);
	if (n == 0){n = 1;}
	return(l[n-1]);
}